# Задание 4: Сравнение Героев (10 минут)
# Цель: Реализовать магические методы сравнения.

# В классе Hero реализуйте магические методы для сравнения героев по их текущему уровню здоровья (_health):
# __eq__(other) (равно, ==)
# __lt__(other) (меньше, <)
# __gt__(other) (больше, >)
# Пример использования (продолжение):

# hero1 = Hero("Арагорн", 100)

# hero2 = Hero("Гэндальф", 120)

# hero3 = Hero("Леголас", 100)


# print(hero1 == hero2)

# print(hero1 == hero3)

# print(hero1 < hero2)

# print(hero1 > hero2)

   

# Ожидаемый результат:

# False

# True

# True

# False

   

