# Методы проверки строк
s = "Теория без воды. Задачи с автоматмической проверкой."
s = "H123"
s = "H123."
s = " "
print(s)
print(s.isalnum())# Проверяет что строка состоит только из букв и(или) цифр
print(s.isalpha()) # Проверяет что строка состоит тоько из букв
print(s.isdigit()) # Проверяет что строка состоит только из цифр
print(s.islower()) # Проверяет что вся строка написана с нижнего регистра букв
print(s.isupper()) # Проверяет что вся строка написана с верхнего регистра букв
print(s.istitle()) # Проверяет что каждое слово начинается с большой буквы
print(s.isspace()) # Проверяет что строка состоит только из пустых символов
