s = "Теория без воды. Задачи с автоматмической проверкой."
# print(s)
# print(s.capitalize())# делает первый символ заглавным, все остальные мелкие
# print(s.lower()) # делает все символы к нижнему регистру
# print(s.upper()) #  делает все символы к верхнему регистру
# print(s.title()) # делает каждое слово с большой буквы, остальные с маленькой
# print(s.swapcase()) # меняет регистр букв на противоположный

# поиск подстроки в строке
# print(s)
# print(s.count(".")) # считает количество символов или слов( в данном случае точку)
# print(s.count(".", 20 )) #20 индекс с какого символа искать( в данном случае точку)
# print(s.count(".", 5, 10 )) # с какого и по какой символ искать( в данном случае точку)
print(s)
# print(s.find(".")) # Ищет индекс вхождения символа
# print(s.find("." , 20))
# print(s.find(".",20, 30))
# print(s.rfind(".")) # Ищет индекс справа налево
# print(s.index("."))
# print(s.index(".",20, 30)) # выдаёт ошибку
# print(s.r.index(".")) # Ищет справа налево
# Метод проверки и конца текста
print(s)
print(s.startswith("Тео"))
print(s.startswith("тео"))
print(s.endswith("."))
print(s.endswith(" "))